{
  "Version": "1.3",
  "ID": "f15mpeltoy5lvojv3gaihclk7eh4wh7kwd5367tly",
  "Issue Number": "25",
  "Client": {
    "Name": "NShared",
    "Region": "Hong Kong",
    "Industry": "Life Science / Healthcare",
    "Website": "",
    "Social Media": "",
    "Social Media Type": "Slack",
    "Role": "Dataset Owner"
  },
  "Project": {
    "Brief history of your project and organization": "Company Name: NShared Investment Global Limited\r\nEstablished: 2022\r\nRegistered in: United Kingdom\r\nHeadquarters: Hong Kong\r\nMain Business: Financial Services\r\n\r\nCompany Overview:\r\n\r\nNShared Investment Global Limited, established in 2022, is headquartered in Hong Kong and registered in the United Kingdom. The company focuses on providing comprehensive financial services to global clients, covering multiple sectors such as asset management, investment consulting, and fintech solutions. NShared is dedicated to helping clients achieve asset growth and maintain a competitive edge in complex market environments through innovative financial technologies and data management strategies.\r\n\r\nCore Business Areas:\r\n\r\nAsset Management\r\nNShared Investment Global Limited offers tailored asset management services. By conducting thorough market analysis and risk management, the company ensures the stability and maximization of investment returns. Whether institutional clients or individual investors, NShared provides customized asset allocation solutions to meet their needs.\r\n\r\nInvestment Consulting\r\nWith a team of experienced investment advisors, the company provides precise market trend analysis, investment strategy recommendations, and risk assessments, helping clients make informed decisions in global markets.\r\n\r\nFintech Solutions\r\nNShared Investment Global Limited leverages financial technology (Fintech) innovations to deliver secure and convenient financial solutions to its clients. Whether it's data storage, risk management, or automated trading, NShared uses cutting-edge technology to offer efficient digital services.\r\n\r\nData Storage Requirements:\r\n\r\nAs a financial company, NShared Investment Global Limited handles a large volume of financial data, including client transaction records, market analysis data, and investment portfolios. The storage and management of this data are crucial. The company employs advanced data storage technologies to ensure the security, reliability, and traceability of its data. NShared places great emphasis on data compliance, adhering to global financial regulatory standards to ensure the safe storage and transmission of client information and market data.\r\n\r\nCompany Vision:\r\n\r\nNShared Investment Global Limited aims to become a global leader in financial services by driving innovation and leveraging technology. The company focuses on delivering value to clients, continually enhancing customer experience, and expanding its influence in the financial markets. NShared is committed to creating sustainable growth in the ever-evolving global financial landscape.\r\n\r\nConclusion:\r\n\r\nWith its extensive experience in the financial sector and a global outlook, NShared Investment Global Limited continues to expand its business footprint while optimizing data management and financial services. In the future, NShared will continue to innovate and strive to provide more comprehensive and intelligent financial solutions for its clients.",
    "Is this project associated with other projects/ecosystem stakeholders?": "Yes",
    "Describe the data being stored onto Filecoin": "1. Client Transaction Data\r\nDefinition: Client transaction data includes detailed records of the transactions clients make on financial platforms, such as stock purchases, bond transactions, foreign exchange trades, commodity futures, etc.\r\nTypical Data Fields:\r\nTransaction time, transaction type (buy, sell)\r\nFinancial instrument names (such as stock or bond codes)\r\nTransaction quantity and price\r\nFees and charges (commissions, taxes)\r\nPublic Storage Possibility:\r\nAnonymized and Aggregated Data: Client transaction behaviors can be aggregated and anonymized for public storage. For instance, aggregated data on the overall trading volume or frequency of a specific stock can be shared without revealing individual client details.\r\nSensitive Data Handling: Personal identity information, account balances, and other sensitive information should not be publicly stored. Any data that is shared must remove personally identifiable information (PII).\r\n2. Market Analysis Data\r\nDefinition: Market analysis data refers to reports or forecasts generated from analyzing market behavior, historical trends, and economic factors. This includes in-depth assessments of market trends, industry performance, and economic indicators.\r\nTypical Data Fields:\r\nEconomic indicators (e.g., GDP growth rate, inflation rate)\r\nPerformance data of specific stocks or commodities within an industry\r\nHistorical market trends (e.g., stock price fluctuations)\r\nIndustry or market forecasts and model analysis results\r\nPublic Storage Possibility:\r\nNon-Personal Data: Market analysis data usually doesn’t involve personal information and can be publicly stored if it complies with industry standards. For example, long-term trend analysis reports for a specific stock or supply-demand models for a market can be shared.\r\nCommercial Sensitivity: Some market analysis data related to company strategies, proprietary models, or innovations might need to remain confidential to maintain competitive advantage.\r\n3. Investment Records\r\nDefinition: Investment records refer to detailed accounts of investment behaviors over time, including asset allocation, trade decisions, and investment returns.\r\nTypical Data Fields:\r\nInvestment targets (e.g., stocks, funds, bonds)\r\nInvestment amounts, buy/sell timing\r\nInvestment returns, loss/gain records\r\nChanges in investment portfolios\r\nPublic Storage Possibility:\r\nAggregated and Statistical Data: Similar to transaction data, investment records can be aggregated for public storage. For instance, the overall return rate of a fund’s investment portfolio or the industry distribution of investments can be shared without revealing specific personal or institutional strategies.\r\nSensitive Information Handling: Specific investment decisions and strategy information are sensitive, particularly if they detail a particular client or institution’s investment plans or asset allocation. Such information is usually kept confidential.\r\nPrerequisites for Public Data Storage:\r\nData Anonymization: Any data involving personal or institutional information must be anonymized to ensure that individuals or companies cannot be identified from publicly shared data.\r\nAggregated Data Processing: Individual transactions and investment records should be aggregated to exclude detailed descriptions of individual behavior and focus on overall market activities.\r\nCompliance Requirements: Depending on the country or region, public storage of financial data must comply with regulatory requirements, such as the General Data Protection Regulation (GDPR) or the Personal Information Protection Law (PIPL), ensuring the data's legality and compliance.\r\nConclusion:\r\nIn the financial industry, certain transaction data, market analysis data, and investment records can be publicly stored after compliance processing, particularly when anonymized and aggregated. The key is ensuring that client privacy and commercially sensitive information are protected, while adhering to legal and regulatory standards to guarantee the security and legality of the data.",
    "Where was the data currently stored in this dataset sourced from": "My Own Storage Infra",
    "How do you plan to prepare the dataset": "1. **Data Collection**\r\n   - **Data Source Identification**: Manually label and differentiate existing disks to identify publicly storable data.\r\n   - **Automation Tools**:\r\n     - **SQL Queries**: Used for databases such as MySQL and PostgreSQL.\r\n     - **API**: Use tools like Postman or Python's `requests` library to fetch real-time data.\r\n     - **ETL Tools (Extract, Transform, Load)**: Tools like Apache NiFi, Talend, or Airbyte can automate and scale the data extraction process.\r\n\r\n2. **Data Import**\r\n   - **Storage**: Store data in the appropriate system based on its format and size:\r\n     - **Relational Databases**: Such as MySQL, PostgreSQL, or SQLite (for structured data).\r\n     - **NoSQL Databases**: Such as MongoDB or Cassandra (for semi-structured or unstructured data).\r\n   - **Automation**: Use ETL/ELT pipelines (e.g., Apache Airflow) to automate the data import process, ensuring regular and consistent data loading.\r\n   - **IPFS**: Tools like Lotus or Boost are required for this.",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "https://drive.google.com/drive/folders/14EPNVuusY7WhJMg57FE2HXfTxdI411e_?usp=sharing",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[X] I confirm",
    "What is the expected retrieval frequency for this data": "Yearly",
    "For how long do you plan to keep this dataset stored on Filecoin": "2 to 3 years",
    "In which geographies do you plan on making storage deals": "Greater China, Asia other than Greater China, North America",
    "How will you be distributing your data to storage providers": "HTTP or FTP server, IPFS, Shipping hard drives",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f02980903  South Korea\r\nf02826253  Singapore\r\nf03157883  china-Guangdong\r\nf02826815  Hong Kong\r\nf03179570  Singapore",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "3PiB",
    "Single Size Dataset": "500TiB",
    "Replicas": 6,
    "Weekly Allocation": "1PiB"
  },
  "Lifecycle": {
    "State": "ReadyToSign",
    "Validated At": "2024-10-17 02:21:49.758302264 UTC",
    "Validated By": "DaYouGroup",
    "Active": true,
    "Updated At": "2024-10-17 02:21:49.758306257 UTC",
    "Active Request ID": "19d0e228-2866-4885-ad35-05eba1eb767a",
    "On Chain Address": "f15mpeltoy5lvojv3gaihclk7eh4wh7kwd5367tly",
    "Multisig Address": "false",
    "edited": false
  },
  "Allocation Requests": [
    {
      "ID": "9832851e-52a8-44f3-a680-1bcba008e387",
      "Request Type": "First",
      "Created At": "2024-09-19 09:29:55.161601303 UTC",
      "Updated At": "2024-09-19 09:29:55.161602835 UTC",
      "Active": false,
      "Allocation Amount": "100TiB",
      "Signers": [
        {
          "Github Username": "DaYouGroup",
          "Signing Address": "f1cl4gtwjlt5udxwootzllba3kcyisjphujviiimq",
          "Created At": "2024-09-19 09:31:58.888000000 UTC",
          "Message CID": "bafy2bzacedw55kpcshm4p7eca64g25xo2qmtvsrnpakpncjuqncb2m6pkjxyq"
        }
      ]
    },
    {
      "ID": "18c89f60-64b0-4076-8232-bbe0f21d0ecb",
      "Request Type": "Refill",
      "Created At": "2024-09-23 07:31:45.226347399 UTC",
      "Updated At": "2024-09-23 07:31:45.226348854 UTC",
      "Active": false,
      "Allocation Amount": "150TiB",
      "Signers": [
        {
          "Github Username": "DaYouGroup",
          "Signing Address": "f1cl4gtwjlt5udxwootzllba3kcyisjphujviiimq",
          "Created At": "2024-09-23 07:38:07.253000000 UTC",
          "Message CID": "bafy2bzacebuqgtpjdaw67lrtwfnuvzo6dn3sbo5n2gmabnc6wdnfs4bo5bvmu"
        }
      ]
    },
    {
      "ID": "70749cb6-8199-47d5-9399-c9b036ce2389",
      "Request Type": "Refill",
      "Created At": "2024-09-26 07:57:42.678770456 UTC",
      "Updated At": "2024-09-26 07:57:42.678771496 UTC",
      "Active": false,
      "Allocation Amount": "250TiB",
      "Signers": [
        {
          "Github Username": "DaYouGroup",
          "Signing Address": "f1cl4gtwjlt5udxwootzllba3kcyisjphujviiimq",
          "Created At": "2024-09-26 07:59:38.091000000 UTC",
          "Message CID": "bafy2bzaceby3z65dhgj4fkgnm733lu4yp7t2gyjuluk6ec72qc3ocnhiqtnso"
        }
      ]
    },
    {
      "ID": "def07550-f573-4ccd-a567-cc77beb91707",
      "Request Type": "Refill",
      "Created At": "2024-10-04 06:35:11.191579280 UTC",
      "Updated At": "2024-10-04 06:35:11.191579920 UTC",
      "Active": false,
      "Allocation Amount": "500TiB",
      "Signers": [
        {
          "Github Username": "DaYouGroup",
          "Signing Address": "f1cl4gtwjlt5udxwootzllba3kcyisjphujviiimq",
          "Created At": "2024-10-08 01:33:00.840000000 UTC",
          "Message CID": "bafy2bzaced6bp33ct5qzwzpbgncvyfgybxmuj66kwjabett764gqq4ydmkdjs"
        }
      ]
    },
    {
      "ID": "19d0e228-2866-4885-ad35-05eba1eb767a",
      "Request Type": "Refill",
      "Created At": "2024-10-17 02:21:49.758314601 UTC",
      "Updated At": "2024-10-17 02:21:49.758315480 UTC",
      "Active": true,
      "Allocation Amount": "1PiB",
      "Signers": []
    }
  ]
}